Revit 2026 API

# FilterDialog Class

---

Allows display of the dialog used to create and edit FilterElements in Autodesk Revit.

SystemObject Autodesk.Revit.UIFilterDialog

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FilterDialog : IDisposable
```
```vb
Public Class FilterDialog
	Implements IDisposable
```
```cpp
public ref class FilterDialog : IDisposable
```
```fsharp
type FilterDialog =
    class
        interface IDisposable
    end
```

The FilterDialog type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | FilterDialog(Document, ElementId) | Constructs a new instance of the FilterDialog class, while setting the id of the FilterElement to be selected when the dialog is shown. |
|  | FilterDialog(Document, String) | Constructs a new instance of the FilterDialog class, while setting the name of the new ParameterFilterElement to be created and selected for editing. |

|  | Name | Description |
| --- | --- | --- |
|  | FilterToSelect | The filter element to be selected once Show is invoked. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | NewFilterId | The ElementId of the new filter created. The value is populated after Show method is executed. |
|  | NewFilterName | The name of the new ParameterFilterElement to be created and selected once Show is invoked. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the FilterDialog |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | Show | Shows the FilterDialog editing dialog to the user. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

The class provides the option to launch the dialog by selecting an existing FilterElement, or automatically creating a new ParameterFilterElement. In both cases the affected element will be selected for editing. Note that the user may opt to add, delete or edit any of the available filter elements (or make no changes at all).

#### Reference

Autodesk.Revit.UI Namespace